app/views/posts/index.html.erb

<script type="text/javascript" charset="utf-8">
  $(function (){
    $(".js-more").on('click', function() {
      let id = $(this).data("id")
      $.get("posts/" + id + "/body", function(data) {
        $("#body-" + id).text(data)
      })
    })
  })
---
SELECT "posts".* FROM "posts"